'''
Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) 
'''
num = int(input("введите трехзначное число = "))
one = num//100
two = num % 100//10
three = num % 10
print("сумма цифр числа =", one+two+three)